In [35]:

import pandas as pd
import pyodbc 

server = 'LETICIA' # Substitua pelo nome do servidor SQL Server
database = 'Python'  # Substitua pelo nome do banco de dados
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()   # criando cursor de comando

In [36]:
dados = pd.read_excel(r"C:\Users\Leticia\Desktop\Python-Banco de Dados\Banco de dados\Origem\arquivos_excel\Categoria.xlsx")
display(50)

50

In [20]:
dados

   id                     name
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares
5   5              Informática
6   6         Casa e Decoração
7   7              Eletrônicos
8   8          Esporte e Lazer
9   9       Brinquedos e Games

In [21]:
#cursor.execute('truncate table [Produtos]')   #executa tarefa de  apagar dados
#cursor.commit()

In [22]:
#dados.rename(columns={'Name': 'Nome'}, inplace=True)
#dados.head

In [37]:
dados.rename(columns={'name' : 'Nome' }, inplace=True)
dados.head

<bound method NDFrame.head of    id                     Nome
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares
5   5              Informática
6   6         Casa e Decoração
7   7              Eletrônicos
8   8          Esporte e Lazer
9   9       Brinquedos e Games>

In [39]:
#tabele de origem no banco de dados
str(dados.columns).replace("'","")

'Index([id, Nome], dtype=object)'

In [24]:
dados

   id                     Nome
0   0        Moda e Acessórios
1   1  Cosméticos e Perfumaria
2   2         Eletrodomésticos
3   3                   Livros
4   4                Celulares
5   5              Informática
6   6         Casa e Decoração
7   7              Eletrônicos
8   8          Esporte e Lazer
9   9       Brinquedos e Games

In [38]:
for index, linha in dados.iterrows():
    
    cursor.execute("Insert into [Categoria](id,Nome)values(?,?)",(linha['id'],linha['Nome'])) 
     # inserir colunas e quantas colunas tiver passar quantidade de ??
cursor.commit()   # validar dados no SQL Server
cursor.close()    #Fechar Cursor
conexaoDB.close() #Fechar Conexao

In [1]:
# Assuming 'dados' is your dataframe
for index, linha in dados.iterrows():
    cursor.execute("Insert into [Categoria](id, Nome) values(?, ?)", (linha['id'], linha['Nome']))
    # inserir colunas e quantas colunas tiver passar quantidade de ??

cursor.commit()   # validar dados no SQL Server
cursor.close()    # Fechar Cursor
conexaoDB.close() # Fechar Conexao

NameError: name 'dados' is not defined